Hi @Luubosi,
Do you see still seeing this issue?? 
Is certificate and keys are imported onto BIGIP??  i just verified this scenario with using certificate and keys import resources.

```
resource "bigip_ssl_certificate" "test-cert" {
  name      = "${lookup(var.vs_lb, "client_profile")}_2020_${var.env}.crt"
  content   = file("examples/servercert.crt")
  partition = "Common"
}

resource "bigip_ssl_key" "test-key" {
  name      = "${lookup(var.vs_lb, "client_profile")}_2020_${var.env}.key"
  content   = file("examples/serverkey.key")
  partition = "Common"
}

resource "bigip_ltm_profile_client_ssl" "test-ClientSsl" {
  name = "/Common/${lookup(var.vs_lb, "client_profile")}_${var.env}"
  cert = "/Common/${lookup(var.vs_lb, "client_profile")}_2020_${var.env}.crt"
  key  = "/Common/${lookup(var.vs_lb, "client_profile")}_2020_${var.env}.key"
  depends_on = [bigip_ssl_certificate.test-cert, bigip_ssl_key.test-key]
}
```

**Output of terraform apply & terraform show**

```
HYD-ML-00064448:terraform-provider-bigip chinthalapalli$ terraform apply

bigip_ltm_profile_client_ssl.test-ClientSsl: Refreshing state... [id=/Common/lbeform_INT]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_profile_client_ssl.test-ClientSsl will be created
  + resource "bigip_ltm_profile_client_ssl" "test-ClientSsl" {
      + alert_timeout                       = (known after apply)
      + allow_non_ssl                       = (known after apply)
      + authenticate                        = (known after apply)
      + authenticate_depth                  = (known after apply)
      + ca_file                             = (known after apply)
      + cache_size                          = (known after apply)
      + cache_timeout                       = (known after apply)
      + cert                                = "/Common/lbeform_2020_INT.crt"
      + cert_extension_includes             = (known after apply)
      + cert_life_span                      = (known after apply)
      + cert_lookup_by_ipaddr_port          = (known after apply)
      + chain                               = (known after apply)
      + ciphers                             = (known after apply)
      + client_cert_ca                      = (known after apply)
      + crl_file                            = (known after apply)
      + defaults_from                       = "/Common/clientssl"
      + forward_proxy_bypass_default_action = (known after apply)
      + full_path                           = (known after apply)
      + generation                          = (known after apply)
      + generic_alert                       = (known after apply)
      + handshake_timeout                   = (known after apply)
      + id                                  = (known after apply)
      + inherit_cert_keychain               = (known after apply)
      + key                                 = "/Common/lbeform_2020_INT.key"
      + mod_ssl_methods                     = (known after apply)
      + mode                                = (known after apply)
      + name                                = "/Common/lbeform_INT"
      + partition                           = (known after apply)
      + passphrase                          = (known after apply)
      + peer_cert_mode                      = (known after apply)
      + proxy_ca_cert                       = (known after apply)
      + proxy_ca_key                        = (known after apply)
      + proxy_ca_passphrase                 = (known after apply)
      + proxy_ssl                           = (known after apply)
      + proxy_ssl_passthrough               = (known after apply)
      + renegotiate_period                  = (known after apply)
      + renegotiate_size                    = (known after apply)
      + renegotiation                       = (known after apply)
      + retain_certificate                  = (known after apply)
      + secure_renegotiation                = (known after apply)
      + server_name                         = (known after apply)
      + session_mirroring                   = (known after apply)
      + session_ticket                      = (known after apply)
      + sni_default                         = (known after apply)
      + sni_require                         = (known after apply)
      + ssl_forward_proxy                   = (known after apply)
      + ssl_forward_proxy_bypass            = (known after apply)
      + ssl_sign_hash                       = (known after apply)
      + strict_resume                       = (known after apply)
      + tm_options                          = (known after apply)
      + unclean_shutdown                    = (known after apply)

      + cert_key_chain {
          + cert       = (known after apply)
          + chain      = (known after apply)
          + key        = (known after apply)
          + name       = (known after apply)
          + passphrase = (known after apply)
        }
    }

  # bigip_ssl_certificate.test-cert will be created
  + resource "bigip_ssl_certificate" "test-cert" {
      + content   = (sensitive value)
      + id        = (known after apply)
      + name      = "lbeform_2020_INT.crt"
      + partition = "Common"
    }

  # bigip_ssl_key.test-key will be created
  + resource "bigip_ssl_key" "test-key" {
      + content   = (sensitive value)
      + id        = (known after apply)
      + name      = "lbeform_2020_INT.key"
      + partition = "Common"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ssl_certificate.test-cert: Creating...
bigip_ssl_key.test-key: Creating...
bigip_ssl_key.test-key: Creation complete after 2s [id=lbeform_2020_INT.key]
bigip_ssl_certificate.test-cert: Creation complete after 2s [id=lbeform_2020_INT.crt]
bigip_ltm_profile_client_ssl.test-ClientSsl: Creating...
bigip_ltm_profile_client_ssl.test-ClientSsl: Creation complete after 2s [id=/Common/lbeform_INT]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

HYD-ML-00064448:terraform-provider-bigip chinthalapalli$ terraform apply
bigip_ssl_key.test-key: Refreshing state... [id=lbeform_2020_INT.key]
bigip_ssl_certificate.test-cert: Refreshing state... [id=lbeform_2020_INT.crt]
bigip_ltm_profile_client_ssl.test-ClientSsl: Refreshing state... [id=/Common/lbeform_INT]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

HYD-ML-00064448:terraform-provider-bigip chinthalapalli$ terraform show
# bigip_ltm_profile_client_ssl.test-ClientSsl:
resource "bigip_ltm_profile_client_ssl" "test-ClientSsl" {
    alert_timeout                       = "indefinite"
    allow_non_ssl                       = "disabled"
    authenticate                        = "once"
    authenticate_depth                  = 9
    ca_file                             = "none"
    cache_size                          = 262144
    cache_timeout                       = 3600
    cert                                = "/Common/lbeform_2020_INT.crt"
    cert_extension_includes             = [
        "basic-constraints",
        "subject-alternative-name",
    ]
    cert_life_span                      = 30
    cert_lookup_by_ipaddr_port          = "disabled"
    chain                               = "none"
    ciphers                             = "DEFAULT"
    client_cert_ca                      = "none"
    crl_file                            = "none"
    defaults_from                       = "/Common/clientssl"
    forward_proxy_bypass_default_action = "intercept"
    generic_alert                       = "enabled"
    handshake_timeout                   = "10"
    id                                  = "/Common/lbeform_INT"
    inherit_cert_keychain               = "false"
    key                                 = "/Common/lbeform_2020_INT.key"
    mod_ssl_methods                     = "disabled"
    mode                                = "enabled"
    name                                = "/Common/lbeform_INT"
    partition                           = "Common"
    peer_cert_mode                      = "ignore"
    proxy_ssl                           = "disabled"
    proxy_ssl_passthrough               = "disabled"
    renegotiate_period                  = "indefinite"
    renegotiate_size                    = "indefinite"
    renegotiation                       = "enabled"
    retain_certificate                  = "true"
    secure_renegotiation                = "require"
    server_name                         = "none"
    session_mirroring                   = "disabled"
    session_ticket                      = "disabled"
    sni_default                         = "false"
    sni_require                         = "false"
    ssl_forward_proxy                   = "disabled"
    ssl_forward_proxy_bypass            = "disabled"
    ssl_sign_hash                       = "any"
    strict_resume                       = "disabled"
    tm_options                          = []
    unclean_shutdown                    = "enabled"
}

# bigip_ssl_certificate.test-cert:
resource "bigip_ssl_certificate" "test-cert" {
    content   = (sensitive value)
    id        = "lbeform_2020_INT.crt"
    name      = "lbeform_2020_INT.crt"
    partition = "Common"
}

# bigip_ssl_key.test-key:
resource "bigip_ssl_key" "test-key" {
    content   = (sensitive value)
    id        = "lbeform_2020_INT.key"
    name      = "lbeform_2020_INT.key"
    partition = "Common"
}

```
